soap/spec/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <wd:Get_Workers_Request xmlns:wd="urn:com.workday/bsvc">
            <wd:Request_References>
                <wd:Worker_Reference>
                    <wd:ID wd:type="WID">b3c518ac84321001c1c8ed9c98790000</wd:ID>
                </wd:Worker_Reference>
            </wd:Request_References>
            <wd:Response_Filter>
                <wd:Count>1</wd:Count>
            </wd:Response_Filter>
        </wd:Get_Workers_Request>
    </soap:Body>
</soap:Envelope>


<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <wd:Get_Candidates_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v46.0">
            <wd:Request_References>
                <wd:Candidate_Reference>
                    <wd:ID wd:type="WID">8828a84896248192f4886d9ad4556514</wd:ID>
                </wd:Candidate_Reference>
            </wd:Request_References>
            <wd:Response_Filter>
                <wd:Count>1</wd:Count>
            </wd:Response_Filter>
        </wd:Get_Candidates_Request>
    </soap:Body>
</soap:Envelope>





<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <wd:Get_Job_Application_Additional_Data_Request xmlns:wd="urn:com.workday/bsvc"
            wd:version="v46.0">
            <wd:Request_References>
                <wd:Job_Application_Request_References>
                    <wd:ID wd:type="WID">8828a84896248192f4886d9ad4556514</wd:ID>
                </wd:Job_Application_Request_References>
            </wd:Request_References>
            <wd:Response_Filter>
                <wd:Count>1</wd:Count>
            </wd:Response_Filter>
        </wd:Get_Job_Application_Additional_Data_Request>
    </soap:Body>
</soap:Envelope>


<wd:Get_Workers_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v45.2">
    <wd:Request_References>
        <wd:Worker_Reference>
            <wd:ID wd:type="WID">b3c518ac84321001c1c8ed9c98790000</wd:ID>
        </wd:Worker_Reference>
    </wd:Request_References>
    <wd:Response_Filter>
        <wd:Count>1</wd:Count>
    </wd:Response_Filter>
</wd:Get_Workers_Request>